import React from 'react';

const Mantra = () => {
  return (
    <div className="bg-[#1b1b1b]/80 py-4 text-center relative overflow-hidden">
      <marquee
        behavior="scroll"
        direction="left"
        scrollAmount="4"
        loop={true}
        className="text-[#FF9933] font-semibold tracking-wide text-[1.05rem] md:text-lg"
      >
        🌸 BHAGWAT BHAWAN 🌸 ब्रज की पावन भूमि मथुरा में आपका सादर अभिनंदन। मैं आशा करता हूँ यह सूची आपके काम आए।
        #मथुरा# •कृष्ण जन्मभूमि •द्वारिका धीश | 
        #वृंदावन# •प्राचीन मंदिर •बांकेबिहारी •राधा रमन •श्री रंगनाथ मंदिर •कात्यायनी पीठ •शाहजी मंदिर •राधा वल्लभ मंदिर •रंगजी मंदिर •निधिवन •गोपीनाथ मंदिर •मदनमोहन मंदिर •गोकुलनंदा •गोविंद देवी जी •प्रेम मंदिर •प्रियकांत जू •चार धाम •इस्कॉन |
        #बरसाना# •श्रीजी मंदिर •मान मंदिर •रंगीली महल •गहवर वन •दान बिहारी •मोर कुटीर मंदिर •विलास गढ़ | 
        #गोवर्धन# •दान घाटी •गोवर्धन परिक्रमा •राधाकृष्ण कुंड •मानसी गंगा •कुसुम सरोवर •मुखारविंद •पूछरी के लौटा |
        #गोकुल# •नन्द भवन •रमन रेती •चिंताहरण महादेव •चौरासी खम्बा •ब्रह्मांड घाट
      </marquee>
    </div>
  );
};

export default Mantra;
